In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\sudip\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\sudip\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.4)

In [2]:
import mysql.connector as conn

In [4]:
mydb = conn.connect(host = "localhost", user = "root", passwd = "mysql")

In [5]:
cursor = mydb.cursor()

In [6]:
cursor.execute('use assim_sql')

In [45]:
cursor.execute('SELECT * FROM worker_table')
cursor.fetchall()

[(1,
  'Mukesh shrestha',
  'Top level',
  230000,
  datetime.datetime(2014, 2, 11, 0, 0)),
 (2,
  'Sabita Malla',
  'Account',
  55000,
  datetime.datetime(2011, 9, 23, 9, 34, 21)),
 (3,
  'Binay Panjiyar',
  'Account',
  41000,
  datetime.datetime(2014, 11, 27, 10, 35, 29)),
 (4, 'Sujan Joshi', 'Cash', 63000, datetime.datetime(2014, 2, 2, 10, 43, 39)),
 (5, 'Ram Shah', 'Driver', 32500, datetime.datetime(2014, 3, 5, 11, 35, 23)),
 (6,
  'Hari Lama',
  'Marketing',
  115300,
  datetime.datetime(2014, 2, 19, 10, 45, 13)),
 (7,
  'Bishal Kumar',
  'Top level',
  215000,
  datetime.datetime(2014, 3, 16, 12, 39, 10)),
 (8,
  'Kavi Bhatari',
  'Top level',
  215000,
  datetime.datetime(2016, 9, 22, 12, 39, 10)),
 (9,
  'Amitabh Bhata',
  'CEO',
  350000,
  datetime.datetime(2016, 9, 22, 11, 23, 17)),
 (10,
  'Vipul Sarma',
  'Marketing',
  123500,
  datetime.datetime(2014, 2, 24, 11, 23, 17)),
 (11,
  'Satish Kumar',
  'Marketing',
  123500,
  datetime.datetime(2013, 3, 22, 11, 23, 17))]

In [21]:
"""Assignment_6"""

'Assignment_6'

In [11]:
cursor.execute('ALTER TABLE worker_table ADD COLUMN Date_Time DATETIME NOT NULL')

In [43]:
cursor.execute('UPDATE worker_table SET Date_Time = "2013-03-22 11:23:17" WHERE Id = 11')

In [44]:
mydb.commit()

In [58]:
"""Q-1. Write an SQL query to print details of the Workers who have joined in Febâ€™2014."""

cursor.execute('SELECT * FROM worker_table WHERE Date_time LIKE "2014-02%"');
cursor.fetchall()

[(1,
  'Mukesh shrestha',
  'Top level',
  230000,
  datetime.datetime(2014, 2, 11, 0, 0)),
 (4, 'Sujan Joshi', 'Cash', 63000, datetime.datetime(2014, 2, 2, 10, 43, 39)),
 (6,
  'Hari Lama',
  'Marketing',
  115300,
  datetime.datetime(2014, 2, 19, 10, 45, 13)),
 (10,
  'Vipul Sarma',
  'Marketing',
  123500,
  datetime.datetime(2014, 2, 24, 11, 23, 17))]

In [61]:
"""Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of
a table."""

cursor.execute('SELECT Department, Salary, COUNT(*) FROM worker_table GROUP BY Department, Salary HAVING COUNT(*) > 1')
cursor.fetchall()

[('Top level', 215000, 2), ('Marketing', 123500, 2)]

In [ ]:
"""Q-3. How to remove duplicate rows from Employees table."""

cursor.execute('DELETE Department FROM worker_table wt1 INNER JOIN worker_table wt2 ON wt1.Id > wt2.Id AND wt1.email = wt2.email')
cursor.fetchall()